[
    {
        "id": "nes",
        "name": "NES Emulator",
        "tech": [
            "Rust", "SDL2"
        ],
        "description": "I worked on this directly after my CHIP-8 Emulator. I really enjoyed both Rust as well as emulation in general, and I thought that this would be a great next step. The emulator can play a significant portion of the system's library without issue, and taught me so much about computers on a low level. It was easily the most fun to complete, and had by far the biggest scope.",
        "source": "https://github.com/mdibble/nes-emu"
    },
    {
        "id": "flick",
        "name": "Flick - Movie Recommendation Service",
        "tech": [
            "React", "Node.js", "Express", "Postgres", "JWT"
        ],
        "description": "Core developer for the backend/database and API of a service that recommends movies for you and your friends that learns from your preferences. Includes user authentication via JWTs, allowing for a secure API.",
        "source": "https://github.com/flick-cp317/core"
    },
    {
        "id": "craft",
        "name": "Minecraft Clone",
        "tech": [
            "C++", "OpenGL" 
        ],
        "description": "Basic clone of the popular game Minecraft. Utilizes a proprietary and scaleable 3D engine that focuses on performance. Includes terrain generation using noisemaps, as well as a dynamic chunk rendering system that loads and unloads chunks based on the player position to maximize efficiency.",
        "source": "https://github.com/mdibble/minecraft-clone"
    },
    {
        "id": "election",
        "name": "2020 US Election Poll Aggregator",
        "tech": [
            "React", "Node.js", "Express", "Mongo" 
        ],
        "description": "This full stack webapp allows users to input polls for the 2020 US Federal Election and can display how each state is trending based on aggregate information. It includes an in-depth REST API that can return detailed information based on specific queries from the client.",
        "source": "https://github.com/mdibble/us-election-polls"
    },
    {
        "id": "chip8-gui",
        "name": "CHIP-8 GUI",
        "tech": [
            "C++", "OpenGL", "Dear ImGui"
        ],
        "description": "A complete rewrite of my CHIP-8 Emulator that makes it a much more complete piece of software. Utilizes OpenGL as the rendering backend, and features a GUI with debugging tools. This was my introduction to OpenGL, and it taught me a lot about the GPU pipeline.",
        "source": "https://github.com/mdibble/chip8-gui"
    },
    {
        "id": "smb",
        "name": "2D Platformer",
        "tech": [
            "C++", "SDL2"
        ],
        "description": "A simple 2D game that recreates the first level of Super Mario Bros. This was my introduction to computer graphics, and acts as a stepping stone to more powerful graphics APIs like OpenGL.",
        "source": "https://github.com/mdibble/sdl2-game"
    },
    {
        "id": "chip8",
        "name": "CHIP-8 Emulator",
        "tech": [
            "Rust", "SDL2"
        ],
        "description": "An emulator of the CHIP-8 instruction set, an architecture that was interpreted on many personal computers throughout the 1970s-80s. This was also my first project built with Rust, and served as my introduction to emulation.",
        "source": "https://github.com/mdibble/chip8-emu"
    },
    {
        "id": "matthew-web",
        "name": "Personal Website",
        "tech": [
            "React", "TypeScript", "styled-components", "Redux"
        ],
        "description": "The website you're on right now! I built this as a way to communicate my portfolio, and it helped me become a better frontend developer. It also uses Redux for global theming, which gave me an excuse to try it with TypeScript.",
        "source": "https://github.com/mdibble/matthew-web"
    },
    {
        "id": "chess",
        "name": "Chess",
        "tech": [
            "C++"
        ],
        "description": "A terminal-friendly version of chess that includes full game rules. This includes en passant, castling, and pawn promotion. I would eventually like to make it so users can play against a chess engine.",
        "source": "https://github.com/mdibble/chess"
    }
    
]